Tekla Open API Reference for Tekla Structures 2025
FormBorders.CheckScreenPosition Method (Window)
 Moves window to primary screen.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void CheckScreenPosition(
	Window window
)
Public Shared Sub CheckScreenPosition (
	window As Window
)
Parameters
window
Type: System.Windows.Window
The window in question.
See Also
Reference
FormBorders Class
CheckScreenPosition Overload
Tekla.Structures.Dialog Namespace